# 8. Замена подстроки
# Дана строка. Замените в этой строке все цифры 1 на слово one. Циклы не использовать.

str1 = '18878211143541 1 4 5 1'
str2 = str1.replace('1', 'one')
print(str2)