# 2. Четные индексы
# Выведите все элементы списка с четными индексами
# (то есть A[0], A[2], A[4], ...).
# Условия не использовать.

lst = list(range(25))
lst2 = lst[::2]
print(lst2)