# 1. Количество различных чисел
# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Примечание. Эту задачу на Питоне можно решить в одну строчку.

set = {1, 2, 3, 6, 6, 3}
print(len(set))
