# Дано расстояние в сантиметрах. Найти число полных метров в нем.
x = float(input('Длина в см: '))
a = x/100
print('Число в полных метрах: ' + str(a))
